In [12]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

# Overview of the Data

In [15]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

### Descriptions of the columns:

- `name` - The name of the country.
- `area` - The total land and sea area of the country.
- `population` - The country's population.
- `population_growth` - The country's population growth as a percentage.
- `birth_rate` - The country's birth rate, or the number of births a year per 1,000 people.
- `death_rate` - The country's death rate, or the number of death a year per 1,000 people.
- `area` - The country's total area (both land and water).
- `area_land` - The country's land area in square kilometers.
- `area_water` - The country's water area in square kilometers.

In [5]:
%%sql
SELECT MIN(population),
    MAX(population),
    MIN(population_growth),
    MAX(population_growth)
    FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

We see that there's a country with population of 0 and a country with population of over 7 billion people.

In [6]:
%%sql
SELECT name, MIN(population)
    FROM facts
    ORDER BY population
    LIMIT 1;

Done.

[('Antarctica', 0)]

In [7]:
%%sql
SELECT name, MAX(population)
    FROM facts
    ORDER BY population DESC
    LIMIT 1;

Done.

[('World', 7256490011)]

We see that the country with 0 population is Antarctica and that the country with over 7 billion people is actually not a country but the entire population on Earth.

In [9]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
    FROM facts
    WHERE name NOT IN ('World','Antarctica');

Done.

[(48, 1367485388, 0.0, 4.02)]

After excluding Antarctica and World, we see that the minimum population is actually 48 and the maximum population of a country is around 1.4 billion.

In [16]:
%%sql
SELECT AVG(population)
    FROM facts
    WHERE name <> 'World';

Done.

[(32242666.56846473,)]

We see that the average population of a country is around 32 million people.

In [17]:
%%sql
SELECT AVG(area)
    FROM facts
    WHERE name <> 'World';

Done.

[(555093.546184739,)]

We see that the average area of a country is around 555 thousand square kilometers.

## Finding the most Densely Populated Countries

These countries have:
- Above average population
- Below average land (area)

Ordered by density (population/area)

In [20]:
%%sql
SELECT name, area, population, population/area AS density
    FROM facts 
    WHERE (population > 32242666) AND (area < 555093)
    ORDER BY density DESC
    ;

Done.

[('Bangladesh', 148460, 168957745, 1138),
 ('Korea, South', 99720, 49115196, 492),
 ('Philippines', 300000, 100998376, 336),
 ('Japan', 377915, 126919659, 335),
 ('Vietnam', 331210, 94348835, 284),
 ('United Kingdom', 243610, 64088222, 263),
 ('Germany', 357022, 80854408, 226),
 ('Italy', 301340, 61855120, 205),
 ('Uganda', 241038, 37101745, 153),
 ('Thailand', 513120, 67976405, 132),
 ('Poland', 312685, 38562189, 123),
 ('Spain', 505370, 48146134, 95),
 ('Iraq', 438317, 37056169, 84),
 ('Morocco', 446550, 33322699, 74)]

These are the most densely populated countries in the world!